---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.RemoveGroupSketchConstraintParent
source: html/684e6497-0090-c428-75d7-56a9335691f7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.RemoveGroupSketchConstraintParent Property

You are removing an element from the group which is involved in a sketch or family constraint with another element of the same group.
 Either remove the constraint or cancel the removal of this element from the group.

## Syntax (C#)
```csharp
public static FailureDefinitionId RemoveGroupSketchConstraintParent { get; }
```